Revit 2027 API
BuiltInFailures.GroupFailures.UnableToGroupElems Property
 Revit does not allow grouping of some of the selected elements. These elements will not be included in the group.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId UnableToGroupElems { get; }
Public Shared ReadOnly Property UnableToGroupElems As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ UnableToGroupElems {
	FailureDefinitionId^ get ();
}
static member UnableToGroupElems : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.GroupFailures Class
Autodesk.Revit.DB Namespace